---
kind: enumMember
id: F:Autodesk.Revit.DB.Mechanical.SystemCalculationLevel.Performance
enum: Autodesk.Revit.DB.Mechanical.SystemCalculationLevel
source: html/943d63fc-da2f-f981-5668-8a45b34e0e91.htm
---
# Autodesk.Revit.DB.Mechanical.SystemCalculationLevel.Performance

This mode is reserved for limiting the system propagation and other performance-boosting options.
 Note that the system-related functionalities might be traded off for faster layout capability in large system when this mode is on.
 Be careful that this mode is NOT included in the "All" mode.